src/DataProcessors/МенеджерРолиPult.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>МенеджерРолиPult</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/МенеджерРолиPult/Ext/ObjectModule.bsl
#Область ПрикладнойПрограммныйИнтерфейс

#КонецОбласти

#Область ОбщийПрограммныйИнтерфейс

Функция УстановитьРоль() Экспорт 

	Результат = УдаленноеУправление.ВыполнитьБазовуюНастройку(Компьютер, НЕ ПустаяСтрока(ПараметрОперации("Принудительно")));
	Если НЕ Результат.КодВозврата = 0  Тогда
		Возврат Результат(Результат.КодВозврата, "Не удалось выполнить базовую настройку: " + Результат.ОписаниеОшибки, Результат.Лог);
	КонецЕсли;
	
	КодКоманды = СтрШаблон("%1 /F ""%2"" /N""pult"" /P""2684"" /DisableStartupMessages /C ""ВыполнитьУстановку(%3)""", УдаленноеУправление.ПутьКПлатформе(), УдаленноеУправление.КаталогПустойБазы(), Справочники.Компьютеры.Идентификатор(Компьютер));
	Возврат УдаленноеУправление.ВыполнитьКомандуCMD(Компьютер, КодКоманды, Истина, Истина);
	
КонецФункции

Функция ПроверитьРоль() Экспорт 

	Попытка
		Ответ = КоннекторHTTP.GetJson(СтрШаблон("http://pult:2684@%1:5080/pult/hs/pult/ping", Компьютер.IP));
		Тело = ПолучитьСтрокуИзДвоичныхДанных(Ответ.Тело);
		Если СтрЧислоВхождений(Тело, "Pong") > 0 Тогда
			Возврат Результат(0);
		КонецЕсли;
	Исключение
		Возврат Результат(1, ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат(1, "Не получен ответ от сервера");

КонецФункции

Функция УдалитьРоль() Экспорт

	//Логика удаления роли
	
	Возврат Результат(0);

КонецФункции

#КонецОбласти

#Область СлужебныеМетоды

Функция ЭтаРоль()

	Результат = Метаданные().ПолноеИмя();
	Результат = Сред(Результат, СтрНайти(Результат, "МенеджерРоли") + 12);
	Возврат Результат;

КонецФункции

Функция ПараметрОперации(ИмяПараметра)

	Для каждого ПараметрОперации Из ПараметрыОперации Цикл
		Если НРег(СокрЛП(ПараметрОперации.Ключ)) = НРег(СокрЛП(ИмяПараметра)) Тогда
			Возврат ПараметрОперации.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";

КонецФункции

#КонецОбласти
